# 定义集合
my_dict = {
    '王力宏':{
        '部门':'科技部',
        '工资':3000,
        '级别':1
    },
    '周杰伦':{
    '部门':'市场部',
        '工资':5000,
        '级别':2
    },
    '林俊杰':{
    '部门':'市场部',
        '工资':7000,
        '级别':3
    },
    '张学友':{
    '部门':'科技部',
        '工资':4000,
        '级别':1
    },
    '刘德华':{
    '部门':'市场部',
        '工资':6000,
        '级别':2
     }
 }
print(f"员工在进行升值加薪之前的结果是：{my_dict}")
# for循环遍历字典
for name in my_dict:
    # if条件判断符合条件员工
    if my_dict[name]["级别"] == 1:
        # 升职加薪
        # 获取到员工的信息字典
        employee_my_dict = my_dict[name]
        # 修改员工信息
        employee_my_dict["级别"] = 2
        employee_my_dict['工资'] += 1000
        # 将员工的信息更新回my_dict
        my_dict[name] = employee_my_dict
# 输出结果
print(f"对员工进行升值加薪后的结果是：{my_dict}")