package HanJia.数组;

public class 二维数组57 {
      /*
             二维数组：
                    也是一个容器，里面储存的是一维数组
             完整格式：
                   数据类型[][]数组名= new 数据类型[][]{{元素1，元素2...},{元素1，元素2,....}};
             简化格式：
                   数据类型[][]数组名={{元素1，元素2...},{元素1，元素2,....}};
              二维数组的访问：
                   格式： 数组名[索引][索引]；
                        第一个索引是告诉二维数组需要哪个一维数组，第二个索引是告诉一维数组需要哪个元素
       */
      public static void main(String[] args) {
          int [][]arr={
                  {11,22},
                  {33,44}
          };

      }
}
