package HanJia.数组;

public class 数组的定义和静态初始化49 {
    /*
    数组的定义格式：
               1.数据类型[] 数组名;
               2.数据类型 数组名[];
     数组的静态初始化：
                 1.完整格式
                     数据类型[] 数组名=new 数据类型[]{元素1，元素2，元素3，.....}
                 2.简化格式
                     数据类型[] 数组名={元素1，元素2，元素3，.....}
     */
    public static void main(String[] args) {
          int [] arr;
//数据类型[] 数组名=new 数据类型[]{元素1，元素2，元素3，.....}
//创建一个int类型的数组，数组名叫arr。数组中储存了11 22 33 这三个数据
          int[] arr1=new int[]{11,22,33};
//数据类型[] 数组名={元素1，元素2，元素3，.....}
          double []arr2={12.2,11.1,2.5};
    }

}
